// Find Errors


#include <stdio.h>

int main(){
    
    int const total = 10;
/*
از کلمه کلیدی 
float
نمی شود به عنوان اسم متغیر استفاده کرد.
*/    
    int f = 0;
    double y = 0.5 , d = 1.5 , z = 2.5;

/*
علامت مساوی همواره در سمت راست می آید
*/
    if( y >= ++d ){
        printf("y : %lf \n", y);

/*
به دنبال 
if
همیشه شرط باید وجود داشته یاشد
*/        
    } else{
        printf("y : %lf \n", y);
    }

    for(int l = -50 ; l < total ; ++l ){
        // این جا خطا وجود ندارند ولی این یک کد بی استفاده است و در روند برنامه تاثیری ندارد
    }
// نباید از کاما بجای سمیکالن استفاده کرد.
    for(y ; y < total ; ++y ){
        // در انتهای دستور حتما باید سمیکالن استفاده کرد.
     /*
        برای نوع متغیر
        double
        از 
        %lf
        استفاده می شود.
      */          
        printf("y = %lf", y); 
    }    

/*
این یک حلقه بی نهایت است.
و هیچگاه تمام نمیشود. برای اینکه به اتمام برسد باید شمارنده با متغیر شرط یکی باشد.
*/ 
    for(d; d< total ; ++d ){
     // در انتهای دستور حتما باید سمیکالن استفاده کرد.
     /*
        برای نوع متغیر
        double
        از 
        %lf
        استفاده می شود.
      */  
        printf("d = %lf", d) ;
    }  

    
/*
در صورتی که برنامه خروجی داشته داشته باشد باید
return 
مشخص شود
*/
    return 0;
}