/*

کالا |  قیمت
------------
5000  | 1
------------
2000  | 2
------------
1000  | 3
------------
2500  | 4



برنامه ای بنویسید اپراتور با وارد کردن شماره کالاهای کاربر و تعداد آن فیش خرید آن ها را صادر کند.

1- اپراتور فقط باید تعداد و شماره کالا را وارد کند
2- فیش باید با فرمت مشخصی چاپ شود.
3- فیش باید شامل تمامی جزییات از جمله قیمت هر کالا، مجموع قیمت هر کالا تعداد هر کالا، قیمت کل و تعداد کل باشد
4- در صورتی که مجموع قیمت ها از 100000 بیشتر شد، به مشتری 15% تخفیف دهد.
قیمت قبل و بعد تخفیف نیز چاپ شود.


نکته:
از آرایه استفاده شود
ایرادهای برنامه گذشته تان نباید وجود داشته باشد.
*/
