/*
برنامه ای بنویسید که 
1- با دریافت کدی از کاربر یکی از این 4 مثلث را در خروجی چاپ کند.
2- همچنین کاربر اندازه مثلث را نیز وارد کند.
3- کاربر تعیین کند که با چه کارکتری می خواهد مثلث چاپ شود.



نوع | مثلت
----------------------
*       |
**      |   A
***     |
****    |
----------------------
****    |
***     |
**      |   B
*       |
----------------------
****    |
 ***    |
  **    |   C
   *    |
---------------------
   *    |    
  **    |
 ***    |   D
****    |
--------------------
*/